routes/web.php

select * from `employers` where `employers`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
---
    // Basically, it's asking to return all jobs WITH the employer for each job
    // This is the equivalent of a SQL query like:
    // SELECT * FROM jobs in SQL
    $jobs = Job::with('employer')->get();